{
    "id":  "b92605fc-1fae-43d4-9353-4f53d54cd90b",
    "name":  "M1 - ACSC Office Hardening Guidelines",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "settings":  [
        {
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_access16v2~policy~l_microsoftofficeaccess~l_applicationsettings~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1"
                                                           }
                                }
        },

{
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_excel16v2~policy~l_microsoftofficeexcel~l_exceloptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1"
                                                           }
                                }
        },

        {
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_ppt16v2~policy~l_microsoftofficepowerpoint~l_powerpointoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1"
                                                           }
                                }
        },


        {
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_visio16v2~policy~l_microsoftvisio~l_visiooptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1"
                                                           }
                                }
        },


{
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_word16v2~policy~l_microsoftofficeword~l_wordoptions~l_security~l_trustcenter_l_blockmacroexecutionfrominternet_1"
                                                           }
                                }
        },



{
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_forceruntimeavscan",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [

                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_office16v3~policy~l_microsoftofficesystem~l_securitysettings_l_forceruntimeavscan_1"
                                                           }
                                }
        },

{
            "settingInstance":  {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                    "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope",
                                    "settingInstanceTemplateReference":  null,
                                    "choiceSettingValue":  {
                                                               "children":  [
                                                                                {
                                                                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                    "settingDefinitionId":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum",
                                                                                    "settingInstanceTemplateReference":  null,
                                                                                    "choiceSettingValue":  {
                                                                                                               "children":  [

                                                                                                                            ],
                                                                                                               "settingValueTemplateReference":  null,
                                                                                                               "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_l_macroruntimescanscopeenum_2"
                                                                                                           }
                                                                                }
                                                                            ],
                                                               "settingValueTemplateReference":  null,
                                                               "value":  "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_securitysettings_l_macroruntimescanscope_1"
                                                           }
                                }
        }

                 ]
}
